bench-bnb/app/models/user.rb

  def self.find_by_credentials(username, password)
    user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Cynthia"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "lprf-CQ5XBUWI4pmsDqEPA"], ["updated_at", "2018-10-05 23:28:12.146790"], ["id", 4]]